# Hands-on 2: String Patterns, Sorting & Grouping

Follow the instructions in [here](https://d3c33hcgiwev3.cloudfront.net/8Pz9EjZZT8O8_RI2WZ_DSg_207c96a4a1aa4243bede99404b9a85f7_Week2Lab1v5.pdf?Expires=1614211200&Signature=fMlsT0y4W4XUKTmYiViJcRCylVfx-20TxlNIr~2ZDiQ74~BuuIvI3KtqGb1G0G5R2s-HLdnYPbY2JicHwajX2P5~eMe8JngJuLFoL8HBZieDghjygSpIad1De1Nf-eJoBHN5a8976DnrggAmc6KVB7WtPd0qPb7~8o3lWdKw00U_&Key-Pair-Id=APKAJLTNE6QMUY6HBC5A)


HR Database
We will be working on a sample HR database for this Lab. 

This HR database schema consists of 5 tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS and LOCATIONS. 

Each table has a few rows of sample data.

# Part I: CREATING TABLES

In [ ]:
import sqlite3
import csv

In [ ]:
# conectando...
conn = sqlite3.connect('hr.db')

In [ ]:
# definindo um cursor
cursor = conn.cursor()

## Reading the script_Create_tables.sql for create the tables

In [ ]:
# Open and read the file as a single buffer
fd = open('/content/Script_Create_Tables.sql', 'r')
sqlFile = fd.read()
fd.close()

In [ ]:
cursor.executescript(sqlFile)

print('Tabelas criadas com sucesso.')

Tabelas criadas com sucesso.

# Part II: LOADING DATA

# Inserting databases into tables

## Insert into EMPLOYEEES

In [ ]:
employees = open("/content/Employees.csv")
employees_rows = csv.reader(employees)
cursor.executemany("INSERT INTO EMPLOYEES VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)", employees_rows)

In [ ]:
cursor.execute("SELECT * FROM EMPLOYEES")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## Insert into JOB_HISTORY

In [ ]:
jobsHistory = open("/content/JobsHistory.csv")
jobsHistory_rows = csv.reader(jobsHistory)
cursor.executemany("INSERT INTO JOB_HISTORY VALUES (?, ?, ?, ?)", jobsHistory_rows)

In [ ]:
cursor.execute("SELECT * FROM JOB_HISTORY")

for linha in cursor.fetchall():
  print(linha)

('E1001', '08/01/2000', '100', '2')
('E1002', '08/01/2001', '200', '5')
('E1003', '08/16/2001', '300', '5')
('E1004', '08/16/2000', '400', '5')
('E1005', '05/30/2000', '500', '2')
('E1006', '08/16/2001', '600', '2')
('E1007', '05/30/2002', '650', '7')
('E1008', '05/06/2010', '660', '7')
('E1009', '08/16/2016', '234', '7')
('E1010', '08/16/2016', '220', '5')

## Insert into JOBS

In [ ]:
jobs = open("/content/Jobs.csv")
jobs_rows = csv.reader(jobs)
cursor.executemany("INSERT INTO JOBS VALUES (?, ?, ?, ?)", jobs_rows)

In [ ]:
cursor.execute("SELECT * FROM JOBS")

for linha in cursor.fetchall():
  print(linha)

('100', 'Sr. Architect', 60000, 100000)
('200', 'Sr. Software Developer', 60000, 80000)
('300', 'Jr.Software Developer', 40000, 60000)
('400', 'Jr.Software Developer', 40000, 60000)
('500', 'Jr. Architect', 50000, 70000)
('600', 'Lead Architect', 70000, 100000)
('650', 'Jr. Designer', 60000, 70000)
('660', 'Jr. Designer', 60000, 70000)
('234', 'Sr. Designer', 70000, 90000)
('220', 'Sr. Designer', 70000, 90000)

## Insert into DEPARTMENTS

In [ ]:
departments = open("/content/Departments.csv")
departments_rows = csv.reader(departments)

# Precisei fazer isso para desconsiderar o valor de chave duplicada.
try:
    cursor.executemany("INSERT INTO DEPARTMENTS VALUES (?, ?, ?, ?)", departments_rows)
except sqlite3.Error:
    pass

In [ ]:
cursor.execute("SELECT * FROM DEPARTMENTS")

for linha in cursor.fetchall():
  print(linha)

('2', 'Architect Group', '30001', 'L0001')
('5', 'Software Group', '30002', 'L0002')
('7', 'Design Team', '30003', 'L0003')

## Insert into LOCATIONS

In [ ]:
locations = open("/content/Locations.csv")
locations_rows = csv.reader(locations)
cursor.executemany("INSERT INTO LOCATIONS VALUES (?, ?)", locations_rows)

In [ ]:
cursor.execute("SELECT * FROM LOCATIONS")

for linha in cursor.fetchall():
  print(linha)

('L0001', '2')
('L0002', '5')
('L0003', '7')

# Part III: COMPOSING AND RUNNING QUERIES

- Query 1: Retrieve all employees whose address is in Elgin,IL
[Hint: Use the LIKE operator to find similar strings]
- Query 2: Retrieve all employees who were born during the 1970's.
[Hint: Use the LIKE operator to find similar strings]
- Query 3: Retrieve all employees in department 5 whose salary is between 60000 and 70000 .
[Hint: Use the keyword BETWEEN for this query ]
- Query 4A: Retrieve a list of employees ordered by department ID.
[Hint: Use the ORDER BY clause for this query]
- Query 4B: Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.
- Query 5A: For each department ID retrieve the number of employees in the department.
[Hint: Use COUNT(*) to retrieve the total count of a column, and then GROUP BY]
- Query 5B: For each department retrieve the number of employees in the department, and the average employees salary in the department.
[Hint: Use COUNT(*) to retrieve the total count of a column, and AVG() function to compute average salaries, and then group]
- Query 5C: Label the computed columns in the result set of Query 5B as “NUM_EMPLOYEES” and “AVG_SALARY”.
[Hint: Use AS “LABEL_NAME” after the column name]
- Query 5D: In Query 5C order the result set by Average Salary.
[Hint: Use ORDER BY after the GROUP BY]
- Query 5E: In Query 5D limit the result to departments with fewer than 4 employees.
[Hint: Use HAVING after the GROUP BY, and use the count() function in the HAVING clause instead of the column label. Note: WHERE clause is used for filtering the entire result set whereas the HAVING clause is used for filtering the result of the grouping]



- BONUS Query 6: Similar to 4B but instead of department ID use department name. Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.
[Hint: Department name is in the DEPARTMENTS table. So your query will need to retrieve data from more than one table. Don’t worry if you are not able to figure this one out … we’ll cover working with multiple tables in the next lesson.]

## Query 1

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
where ADDRESS LIKE '%Elgin,IL%' ;
""")

for linha in cursor.fetchall():
  print(linha)

('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## Query 2

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
where B_DATE LIKE '%197%'
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')

## Query 3

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
where (SALARY BETWEEN 60000 and 70000)  
and DEP_ID = 5 ;
""")

for linha in cursor.fetchall():
  print(linha)

('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

## Query 4A

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
order by DEP_ID
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')

## Query 4B

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
order by DEP_ID desc, L_NAME desc;
""")

for linha in cursor.fetchall():
  print(linha)

('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')

## Query 5A

In [ ]:
cursor.execute("""
select *
from EMPLOYEES
group by DEP_ID;
""")

for linha in cursor.fetchall():
  print(linha)

('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')

## Query 5B

In [ ]:
cursor.execute("""
select DEP_ID, COUNT(*), AVG(SALARY)
from EMPLOYEES
group by DEP_ID;
""")

for linha in cursor.fetchall():
  print(linha)

('2', 3, 86666.66666666667)
('5', 4, 65000.0)
('7', 3, 66666.66666666667)

## Query 5C

In [ ]:
cursor.execute("""
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID;
""")

for linha in cursor.fetchall():
  print(linha)

('2', 3, 86666.66666666667)
('5', 4, 65000.0)
('7', 3, 66666.66666666667)

## Query 5D

In [ ]:
cursor.execute("""
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID
order by AVG_SALARY;
""")

for linha in cursor.fetchall():
  print(linha)

('5', 4, 65000.0)
('7', 3, 66666.66666666667)
('2', 3, 86666.66666666667)

## Query 5E

In [ ]:
cursor.execute("""
select DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
from EMPLOYEES
group by DEP_ID
having count(*) < 4
order by AVG_SALARY;
""")

for linha in cursor.fetchall():
  print(linha)

('7', 3, 66666.66666666667)
('2', 3, 86666.66666666667)

## Query 6

In [ ]:
cursor.execute("""
select D.DEP_NAME , E.F_NAME, E.L_NAME
from EMPLOYEES as E, DEPARTMENTS as D
where E.DEP_ID = D.DEPT_ID_DEP
order by D.DEP_NAME, E.L_NAME desc ;
""")

for linha in cursor.fetchall():
  print(linha)

('Architect Group', 'John', 'Thomas')
('Architect Group', 'Ahmed', 'Hussain')
('Architect Group', 'Nancy', 'Allen')
('Design Team', 'Mary', 'Thomas')
('Design Team', 'Andrea', 'Jones')
('Design Team', 'Bharath', 'Gupta')
('Software Group', 'Steve', 'Wells')
('Software Group', 'Santosh', 'Kumar')
('Software Group', 'Alice', 'James')
('Software Group', 'Ann', 'Jacob')

------------------------------------

# LAB 1: Hands-on Lab: Sub-queries, Multiple Tables

### Part A: Sub-Queries and Nested-Selects

In [ ]:
#Query A1: Enter a failing (i.e. which gives an error) to retrieve all employees whose salary is greater than the average salary

cursor.execute("""
select * from employees where salary > AVG(salary)
""")

for linha in cursor.fetchall():
  print(linha)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 0))

OperationalError: ignored

In [ ]:
# Query A2: Enter a working query using a sub-select to retrieve all employees whose salary is greater than the average salary


cursor.execute("""
select EMP_ID, F_NAME, L_NAME, SALARY from employees where SALARY > (select AVG(SALARY) from employees);
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', 100000)
('E1002', 'Alice', 'James', 80000)
('E1006', 'Nancy', 'Allen', 90000)

In [ ]:
# Query A3: Enter a failing query (i.e. that gives an error) that retrieves all employees records and average salary in every row

cursor.execute("""
select EMP_ID, SALARY, AVG(SALARY) AS AVG_SALARY from employees ;
""")

for linha in cursor.fetchall():
  print(linha)

('E1010', 70000, 72000.0)

In [ ]:
# Query A4: Enter a Column Expression that retrieves all employees records and average salary in every row

cursor.execute("""
select EMP_ID, SALARY, ( select AVG(SALARY) from employees ) AS AVG_SALARY from employees ;

""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 100000, 72000.0)
('E1002', 80000, 72000.0)
('E1003', 50000, 72000.0)
('E1004', 60000, 72000.0)
('E1005', 70000, 72000.0)
('E1006', 90000, 72000.0)
('E1007', 65000, 72000.0)
('E1008', 65000, 72000.0)
('E1009', 70000, 72000.0)
('E1010', 70000, 72000.0)

In [ ]:
#Query A5: Enter a Table Expression that retrieves only the columns with non-sensitive employee data

cursor.execute("""
select * from ( select EMP_ID, F_NAME, L_NAME, DEP_ID from employees) AS EMP4ALL ;
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '2')
('E1002', 'Alice', 'James', '5')
('E1003', 'Steve', 'Wells', '5')
('E1004', 'Santosh', 'Kumar', '5')
('E1005', 'Ahmed', 'Hussain', '2')
('E1006', 'Nancy', 'Allen', '2')
('E1007', 'Mary', 'Thomas', '7')
('E1008', 'Bharath', 'Gupta', '7')
('E1009', 'Andrea', 'Jones', '7')
('E1010', 'Ann', 'Jacob', '5')

### Part B: Accessing Multiple Tables with Sub-Queries

In [ ]:
# Query B1: Retrieve only the EMPLOYEES records that correspond to departments in the DEPARTMENTS table

cursor.execute("""
select * from employees where DEP_ID IN ( select DEPT_ID_DEP from departments );
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

In [ ]:
# Query B2: Retrieve only the list of employees from location L0002

cursor.execute("""
select * from employees where DEP_ID IN ( select DEPT_ID_DEP from departments where LOC_ID = 'L0002' );
""")

for linha in cursor.fetchall():
  print(linha)

('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

In [ ]:
# Query B3: Retrieve the department ID and name for employees who earn more than $70,000

cursor.execute("""
select DEPT_ID_DEP, DEP_NAME from departments where DEPT_ID_DEP IN ( select DEP_ID from employees where SALARY > 70000 ) ;
""")

for linha in cursor.fetchall():
  print(linha)

('2', 'Architect Group')
('5', 'Software Group')

In [ ]:
# Query B4: Specify 2 tables in the FROM clause

cursor.execute("""
select * from employees, departments;
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2', '5', 'Software Group', '30002', 'L0002')
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2', '7', 'Design Team', '30003', 'L0003')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5', '2', 'Architect Group', '30001', 'L0001')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5', '7', 'Design Team', '30003', 'L0003')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5', '2', 'Architect Group', '30001', 'L0001')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5', '7', 'Design Team', '30003', 'L0003')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5', '2', 'Architect Group', '30001', 'L0001')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5', '5', 'Software Group', '30002', 'L0002')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5', '7', 'Design Team', '30003', 'L0003')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2', '5', 'Software Group', '30002', 'L0002')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2', '7', 'Design Team', '30003', 'L0003')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2', '5', 'Software Group', '30002', 'L0002')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2', '7', 'Design Team', '30003', 'L0003')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7', '2', 'Architect Group', '30001', 'L0001')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7', '5', 'Software Group', '30002', 'L0002')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7', '2', 'Architect Group', '30001', 'L0001')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7', '5', 'Software Group', '30002', 'L0002')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7', '2', 'Architect Group', '30001', 'L0001')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7', '5', 'Software Group', '30002', 'L0002')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5', '2', 'Architect Group', '30001', 'L0001')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5', '5', 'Software Group', '30002', 'L0002')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5', '7', 'Design Team', '30003', 'L0003')

### Accessing Multiple Tables with Implicit Joins

In [ ]:
# Query B5: Retrieve only the EMPLOYEES records that correspond to departments in the DEPARTMENTS table

cursor.execute("""
select * from employees, departments where employees.DEP_ID = departments.DEPT_ID_DEP;
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5', '5', 'Software Group', '30002', 'L0002')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5', '5', 'Software Group', '30002', 'L0002')

In [ ]:
# Query B6: Use shorter aliases for table names

cursor.execute("""
select * from employees E, departments D where E.DEP_ID = D.DEPT_ID_DEP;
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5', '5', 'Software Group', '30002', 'L0002')
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5', '5', 'Software Group', '30002', 'L0002')
('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2', '2', 'Architect Group', '30001', 'L0001')
('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7', '7', 'Design Team', '30003', 'L0003')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5', '5', 'Software Group', '30002', 'L0002')

In [ ]:
# Query B7: Retrieve only the Employee ID and Department name in the above query

cursor.execute("""
select EMP_ID, DEP_NAME from employees E, departments D where E.DEP_ID = D.DEPT_ID_DEP;
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'Architect Group')
('E1002', 'Software Group')
('E1003', 'Software Group')
('E1004', 'Software Group')
('E1005', 'Architect Group')
('E1006', 'Architect Group')
('E1007', 'Design Team')
('E1008', 'Design Team')
('E1009', 'Design Team')
('E1010', 'Software Group')

In [ ]:
# Query B8: In the above query specify the fully qualified column names with aliases in the SELECT clause

cursor.execute("""
select E.EMP_ID, D.DEP_NAME from employees E, departments D where E.DEP_ID = D.DEPT_ID_DEP
""")

for linha in cursor.fetchall():
  print(linha)

('E1001', 'Architect Group')
('E1002', 'Software Group')
('E1003', 'Software Group')
('E1004', 'Software Group')
('E1005', 'Architect Group')
('E1006', 'Architect Group')
('E1007', 'Design Team')
('E1008', 'Design Team')
('E1009', 'Design Team')
('E1010', 'Software Group')